# Задача 3
#
# Напишіть програму Банкомат. Втсановіть пін код для користувача(зробимо це константою).
# Запитайте в користувача Пін якщо він введе три рази не вірно то напишіть що карта заблокована.
# Використовуйте цикл while.

print("Програма Банкомат")
PIN = '1903'
pin_counter = 3
while pin_counter > 0:

    verify_pin = input('Введіть PIN код: ')

    if verify_pin == PIN:
        print('Код вірний')
        break

    else:
        pin_counter -= 1
        print(f'Невірний PIN код, залишилось спроб: {pin_counter}')

    if pin_counter == 0:
        print('Карта заблокована')
