# Задача 1
# Напишіть программу "Касир в кінотеватрі", яка попросить користувача ввести свій вік
# (можна використати константу або функцію input(), на екран має бути виведено лише одне повідомлення).
# якщо користувачу менше 7 - вивести повідомлення"Де твої батьки?"
# якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"
# якщо від 16 до 65 то зробіть якесь вітальне повідомлення, на ваш розсуд.
# якщо користувачу більше 65 - вивести повідомлення"Покажіть пенсійне посвідчення!"

print('Задача 1: "Касир в кінотеатрі"')
customer_age =int(input('Вкажіть свій вік: '))
if customer_age < 7:
    print('Де твої батьки?')
elif customer_age < 16:
    print('Це фільм для дорослих!')
elif customer_age <= 65:
    print('Бажаємо приємного перегляду ^_^')
else:
    customer_age > 65
    print('Покажіть пенсійне посвідчення')
