# Задача 3

# Напишіть програму яка в користувача запитує два числа(можуть бути числа типу інт, а можуть бути в стр).
# Потім запитує це стр чи інт і в залежності від відповіді конкатенує їх або додає і повертає результат перемножений
# на три.
# якщо після конкатенації отримали 10 то перемноживши на 3 отримаємо 30.


# Стосовно задачі три малось на увазі що якщо в нас стр то ми конкатенуємо потім трансформуємо в інт і множимо на три.
# Якщо інт то додаємо і множимо на три.


# Рішення задачі.
print('Задача 3')
number_1 = input('Введіть перше число: ')
number_2 = input('Введіть друге число: ')
numbers_type = input('Вкажіть який тип чисeл, int або str: ')
if numbers_type.lower() == 'str':
    concatenation = (number_1 + number_2)
    print('Конкатенація =', concatenation)
    con_int_multi = int(concatenation) * 3
    print('Результат множення',concatenation, 'на 3 =', con_int_multi)
elif numbers_type == 'int':
    sum_numbers = (int(number_1) + int(number_2))*3
    print('Результат додавання',number_1,'та',number_2,'і перемноження на 3 =', sum_numbers)
else:
    print('Невірні типи даних')












