# 2) Напишіть програму яка буде приймати квадратне рівняння і розвязувати його. Памятайте що там є декілька випадків по іксам.
# Завдання не складне але обьємне.
# Подумайте як прийняти дані від користувача, ну і над рештою).


print('Квадратне рівняння: ax*2 + bx +c = 0')
a = int(input('Введіть значення числа a: '))
if  a != 0:
    b = int(input('Введіть значення числа b: '))
    c = int(input('Введіть значення числа c: '))
    print('Квадратне рівняння приймає вигляд:')
    print(a,'* x**2 +',b,'* x +',c,'= 0')
    d = b**2 - 4*a*c
    if d < 0:
        print('Дискриминант менше 0,', 'd =',d)
        print('Немає коренів')
    else:
        if d > 0:
            print('Дискриминант =',d)
            x1 = ((-b) + (d ** (1 / 2))) / (2 * a)
            print('Корінь x1 =', x1)
            x2 = (-(b) - (d ** (1/2)) )/ (2 * a)
            print('Корінь x2 =', x2)
        else:
            x = (-b + (d * (1 / 2))) / (2 * a)
            print('Дискриминант = 0')
            print('Корінь x =', x)
else:
    print('Значення числа а не може дорівнювати 0')

