# Задача 1
# Уявимо що до нас прийшов наш друг або подруга і попросили написати додаток для покупок в магазині
# що б можна було скласти список продуктів та коли купуєш викреслювати(для викреслення питайте номер елемента,
# що б видалити по індексу треба його передати в pop list_a.pop(0) - видалить нульовий індекс, памятайте що користувач не знає що в нас індекси починаються з нуля)
# Також нам відомо що цей список має пять або більше елементів.
# Після кожного видалення елементу виводьте наш оновлений список.
# Після 5 видалень перевірте чи список пустий якщо не пустий напишіть що ось ще є продукти, якщо пусти то напишіть про це.
# Також після цього кроку запропонуйте користувачу написати ще продуктів та додати його в кошик. і виведіть їх на екран. Але цього разу вже без видалень.
# кроки:
# Спочатку пропонуємо користувачу ввести продукти.
# Робимо 5 запитів на видалення
# Перевіряємо корзину
# Пропонуємо додати продукти
# Виводмо список і прощаємось


print('Покупки')
shopping_list = input('Додайте список покупок через пробіл: ').split()
if len(shopping_list) < 1:
    print('Замало товарів, введіть будь-ласка більше товарів у список')
else:
    print('Список продуктів:',shopping_list,sep="\n")


    # item_1 = input('Видаліть покупку: ')
    # delete_item = shopping_list.pop()

# item_1 = input(shoping_list)
# item_2 = input('Додайте другий товар до кошику: ')
# item_3 = input('Додайте третій товар до кошику: ')
# item_4 = input('Додайте четвертий товар до кошику: ')
# item_5 = input('Додайте п`ятий товар до кошику: ')

# print('Список продуктів:',shopping_list,sep="\n")